
## Plan Result (prod)




<pre><code>Plan: 1 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_storage_container.jurisdiction_codes
* Update
  * module.storage_account.azurerm_storage_account.storage_account


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_storage_container.jurisdiction_codes will be created
  + resource "azurerm_storage_container" "jurisdiction_codes" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "jurisdictioncodes"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "emhrsapiprod"
    }

  # module.storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/em-hrs-api-prod/providers/Microsoft.Storage/storageAccounts/emhrsapiprod"
        name                               = "emhrsapiprod"
        tags                               = {
            "application"         = "evidence-management"
            "builtFrom"           = "https://github.com/HMCTS/em-hrs-api.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#em-dev-chat"
            "environment"         = "production"
            "managedBy"           = "Evidence Management"
        }
        # (96 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":2083,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->